// Generated by jextract

package com.github.marschall.objectivej.header;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct task_power_info {
 *     uint64_t total_user;
 *     uint64_t total_system;
 *     uint64_t task_interrupt_wakeups;
 *     uint64_t task_platform_idle_wakeups;
 *     uint64_t task_timer_wakeups_bin_1;
 *     uint64_t task_timer_wakeups_bin_2;
 * }
 * }
 */
public class task_power_info {

    task_power_info() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("total_user"),
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("total_system"),
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("task_interrupt_wakeups"),
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("task_platform_idle_wakeups"),
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("task_timer_wakeups_bin_1"),
        ObjCRuntime.align(ObjCRuntime.C_LONG_LONG, 4).withName("task_timer_wakeups_bin_2")
    ).withName("task_power_info");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong total_user$LAYOUT = (OfLong)$LAYOUT.select(groupElement("total_user"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t total_user
     * }
     */
    public static final OfLong total_user$layout() {
        return total_user$LAYOUT;
    }

    private static final long total_user$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t total_user
     * }
     */
    public static final long total_user$offset() {
        return total_user$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t total_user
     * }
     */
    public static long total_user(MemorySegment struct) {
        return struct.get(total_user$LAYOUT, total_user$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t total_user
     * }
     */
    public static void total_user(MemorySegment struct, long fieldValue) {
        struct.set(total_user$LAYOUT, total_user$OFFSET, fieldValue);
    }

    private static final OfLong total_system$LAYOUT = (OfLong)$LAYOUT.select(groupElement("total_system"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t total_system
     * }
     */
    public static final OfLong total_system$layout() {
        return total_system$LAYOUT;
    }

    private static final long total_system$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t total_system
     * }
     */
    public static final long total_system$offset() {
        return total_system$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t total_system
     * }
     */
    public static long total_system(MemorySegment struct) {
        return struct.get(total_system$LAYOUT, total_system$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t total_system
     * }
     */
    public static void total_system(MemorySegment struct, long fieldValue) {
        struct.set(total_system$LAYOUT, total_system$OFFSET, fieldValue);
    }

    private static final OfLong task_interrupt_wakeups$LAYOUT = (OfLong)$LAYOUT.select(groupElement("task_interrupt_wakeups"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t task_interrupt_wakeups
     * }
     */
    public static final OfLong task_interrupt_wakeups$layout() {
        return task_interrupt_wakeups$LAYOUT;
    }

    private static final long task_interrupt_wakeups$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t task_interrupt_wakeups
     * }
     */
    public static final long task_interrupt_wakeups$offset() {
        return task_interrupt_wakeups$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t task_interrupt_wakeups
     * }
     */
    public static long task_interrupt_wakeups(MemorySegment struct) {
        return struct.get(task_interrupt_wakeups$LAYOUT, task_interrupt_wakeups$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t task_interrupt_wakeups
     * }
     */
    public static void task_interrupt_wakeups(MemorySegment struct, long fieldValue) {
        struct.set(task_interrupt_wakeups$LAYOUT, task_interrupt_wakeups$OFFSET, fieldValue);
    }

    private static final OfLong task_platform_idle_wakeups$LAYOUT = (OfLong)$LAYOUT.select(groupElement("task_platform_idle_wakeups"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t task_platform_idle_wakeups
     * }
     */
    public static final OfLong task_platform_idle_wakeups$layout() {
        return task_platform_idle_wakeups$LAYOUT;
    }

    private static final long task_platform_idle_wakeups$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t task_platform_idle_wakeups
     * }
     */
    public static final long task_platform_idle_wakeups$offset() {
        return task_platform_idle_wakeups$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t task_platform_idle_wakeups
     * }
     */
    public static long task_platform_idle_wakeups(MemorySegment struct) {
        return struct.get(task_platform_idle_wakeups$LAYOUT, task_platform_idle_wakeups$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t task_platform_idle_wakeups
     * }
     */
    public static void task_platform_idle_wakeups(MemorySegment struct, long fieldValue) {
        struct.set(task_platform_idle_wakeups$LAYOUT, task_platform_idle_wakeups$OFFSET, fieldValue);
    }

    private static final OfLong task_timer_wakeups_bin_1$LAYOUT = (OfLong)$LAYOUT.select(groupElement("task_timer_wakeups_bin_1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_1
     * }
     */
    public static final OfLong task_timer_wakeups_bin_1$layout() {
        return task_timer_wakeups_bin_1$LAYOUT;
    }

    private static final long task_timer_wakeups_bin_1$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_1
     * }
     */
    public static final long task_timer_wakeups_bin_1$offset() {
        return task_timer_wakeups_bin_1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_1
     * }
     */
    public static long task_timer_wakeups_bin_1(MemorySegment struct) {
        return struct.get(task_timer_wakeups_bin_1$LAYOUT, task_timer_wakeups_bin_1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_1
     * }
     */
    public static void task_timer_wakeups_bin_1(MemorySegment struct, long fieldValue) {
        struct.set(task_timer_wakeups_bin_1$LAYOUT, task_timer_wakeups_bin_1$OFFSET, fieldValue);
    }

    private static final OfLong task_timer_wakeups_bin_2$LAYOUT = (OfLong)$LAYOUT.select(groupElement("task_timer_wakeups_bin_2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_2
     * }
     */
    public static final OfLong task_timer_wakeups_bin_2$layout() {
        return task_timer_wakeups_bin_2$LAYOUT;
    }

    private static final long task_timer_wakeups_bin_2$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_2
     * }
     */
    public static final long task_timer_wakeups_bin_2$offset() {
        return task_timer_wakeups_bin_2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_2
     * }
     */
    public static long task_timer_wakeups_bin_2(MemorySegment struct) {
        return struct.get(task_timer_wakeups_bin_2$LAYOUT, task_timer_wakeups_bin_2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t task_timer_wakeups_bin_2
     * }
     */
    public static void task_timer_wakeups_bin_2(MemorySegment struct, long fieldValue) {
        struct.set(task_timer_wakeups_bin_2$LAYOUT, task_timer_wakeups_bin_2$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

