// Generated by jextract

package com.github.marschall.objectivej.header;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct vm_region_extended_info {
 *     vm_prot_t protection;
 *     unsigned int user_tag;
 *     unsigned int pages_resident;
 *     unsigned int pages_shared_now_private;
 *     unsigned int pages_swapped_out;
 *     unsigned int pages_dirtied;
 *     unsigned int ref_count;
 *     unsigned short shadow_depth;
 *     unsigned char external_pager;
 *     unsigned char share_mode;
 *     unsigned int pages_reusable;
 * }
 * }
 */
public class vm_region_extended_info {

    vm_region_extended_info() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ObjCRuntime.C_INT.withName("protection"),
        ObjCRuntime.C_INT.withName("user_tag"),
        ObjCRuntime.C_INT.withName("pages_resident"),
        ObjCRuntime.C_INT.withName("pages_shared_now_private"),
        ObjCRuntime.C_INT.withName("pages_swapped_out"),
        ObjCRuntime.C_INT.withName("pages_dirtied"),
        ObjCRuntime.C_INT.withName("ref_count"),
        ObjCRuntime.C_SHORT.withName("shadow_depth"),
        ObjCRuntime.C_CHAR.withName("external_pager"),
        ObjCRuntime.C_CHAR.withName("share_mode"),
        ObjCRuntime.C_INT.withName("pages_reusable")
    ).withName("vm_region_extended_info");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt protection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("protection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * vm_prot_t protection
     * }
     */
    public static final OfInt protection$layout() {
        return protection$LAYOUT;
    }

    private static final long protection$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * vm_prot_t protection
     * }
     */
    public static final long protection$offset() {
        return protection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * vm_prot_t protection
     * }
     */
    public static int protection(MemorySegment struct) {
        return struct.get(protection$LAYOUT, protection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * vm_prot_t protection
     * }
     */
    public static void protection(MemorySegment struct, int fieldValue) {
        struct.set(protection$LAYOUT, protection$OFFSET, fieldValue);
    }

    private static final OfInt user_tag$LAYOUT = (OfInt)$LAYOUT.select(groupElement("user_tag"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int user_tag
     * }
     */
    public static final OfInt user_tag$layout() {
        return user_tag$LAYOUT;
    }

    private static final long user_tag$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int user_tag
     * }
     */
    public static final long user_tag$offset() {
        return user_tag$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int user_tag
     * }
     */
    public static int user_tag(MemorySegment struct) {
        return struct.get(user_tag$LAYOUT, user_tag$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int user_tag
     * }
     */
    public static void user_tag(MemorySegment struct, int fieldValue) {
        struct.set(user_tag$LAYOUT, user_tag$OFFSET, fieldValue);
    }

    private static final OfInt pages_resident$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pages_resident"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int pages_resident
     * }
     */
    public static final OfInt pages_resident$layout() {
        return pages_resident$LAYOUT;
    }

    private static final long pages_resident$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int pages_resident
     * }
     */
    public static final long pages_resident$offset() {
        return pages_resident$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int pages_resident
     * }
     */
    public static int pages_resident(MemorySegment struct) {
        return struct.get(pages_resident$LAYOUT, pages_resident$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int pages_resident
     * }
     */
    public static void pages_resident(MemorySegment struct, int fieldValue) {
        struct.set(pages_resident$LAYOUT, pages_resident$OFFSET, fieldValue);
    }

    private static final OfInt pages_shared_now_private$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pages_shared_now_private"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int pages_shared_now_private
     * }
     */
    public static final OfInt pages_shared_now_private$layout() {
        return pages_shared_now_private$LAYOUT;
    }

    private static final long pages_shared_now_private$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int pages_shared_now_private
     * }
     */
    public static final long pages_shared_now_private$offset() {
        return pages_shared_now_private$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int pages_shared_now_private
     * }
     */
    public static int pages_shared_now_private(MemorySegment struct) {
        return struct.get(pages_shared_now_private$LAYOUT, pages_shared_now_private$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int pages_shared_now_private
     * }
     */
    public static void pages_shared_now_private(MemorySegment struct, int fieldValue) {
        struct.set(pages_shared_now_private$LAYOUT, pages_shared_now_private$OFFSET, fieldValue);
    }

    private static final OfInt pages_swapped_out$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pages_swapped_out"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int pages_swapped_out
     * }
     */
    public static final OfInt pages_swapped_out$layout() {
        return pages_swapped_out$LAYOUT;
    }

    private static final long pages_swapped_out$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int pages_swapped_out
     * }
     */
    public static final long pages_swapped_out$offset() {
        return pages_swapped_out$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int pages_swapped_out
     * }
     */
    public static int pages_swapped_out(MemorySegment struct) {
        return struct.get(pages_swapped_out$LAYOUT, pages_swapped_out$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int pages_swapped_out
     * }
     */
    public static void pages_swapped_out(MemorySegment struct, int fieldValue) {
        struct.set(pages_swapped_out$LAYOUT, pages_swapped_out$OFFSET, fieldValue);
    }

    private static final OfInt pages_dirtied$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pages_dirtied"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int pages_dirtied
     * }
     */
    public static final OfInt pages_dirtied$layout() {
        return pages_dirtied$LAYOUT;
    }

    private static final long pages_dirtied$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int pages_dirtied
     * }
     */
    public static final long pages_dirtied$offset() {
        return pages_dirtied$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int pages_dirtied
     * }
     */
    public static int pages_dirtied(MemorySegment struct) {
        return struct.get(pages_dirtied$LAYOUT, pages_dirtied$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int pages_dirtied
     * }
     */
    public static void pages_dirtied(MemorySegment struct, int fieldValue) {
        struct.set(pages_dirtied$LAYOUT, pages_dirtied$OFFSET, fieldValue);
    }

    private static final OfInt ref_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ref_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int ref_count
     * }
     */
    public static final OfInt ref_count$layout() {
        return ref_count$LAYOUT;
    }

    private static final long ref_count$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int ref_count
     * }
     */
    public static final long ref_count$offset() {
        return ref_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int ref_count
     * }
     */
    public static int ref_count(MemorySegment struct) {
        return struct.get(ref_count$LAYOUT, ref_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int ref_count
     * }
     */
    public static void ref_count(MemorySegment struct, int fieldValue) {
        struct.set(ref_count$LAYOUT, ref_count$OFFSET, fieldValue);
    }

    private static final OfShort shadow_depth$LAYOUT = (OfShort)$LAYOUT.select(groupElement("shadow_depth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned short shadow_depth
     * }
     */
    public static final OfShort shadow_depth$layout() {
        return shadow_depth$LAYOUT;
    }

    private static final long shadow_depth$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned short shadow_depth
     * }
     */
    public static final long shadow_depth$offset() {
        return shadow_depth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned short shadow_depth
     * }
     */
    public static short shadow_depth(MemorySegment struct) {
        return struct.get(shadow_depth$LAYOUT, shadow_depth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned short shadow_depth
     * }
     */
    public static void shadow_depth(MemorySegment struct, short fieldValue) {
        struct.set(shadow_depth$LAYOUT, shadow_depth$OFFSET, fieldValue);
    }

    private static final OfByte external_pager$LAYOUT = (OfByte)$LAYOUT.select(groupElement("external_pager"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned char external_pager
     * }
     */
    public static final OfByte external_pager$layout() {
        return external_pager$LAYOUT;
    }

    private static final long external_pager$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned char external_pager
     * }
     */
    public static final long external_pager$offset() {
        return external_pager$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned char external_pager
     * }
     */
    public static byte external_pager(MemorySegment struct) {
        return struct.get(external_pager$LAYOUT, external_pager$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned char external_pager
     * }
     */
    public static void external_pager(MemorySegment struct, byte fieldValue) {
        struct.set(external_pager$LAYOUT, external_pager$OFFSET, fieldValue);
    }

    private static final OfByte share_mode$LAYOUT = (OfByte)$LAYOUT.select(groupElement("share_mode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned char share_mode
     * }
     */
    public static final OfByte share_mode$layout() {
        return share_mode$LAYOUT;
    }

    private static final long share_mode$OFFSET = 31;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned char share_mode
     * }
     */
    public static final long share_mode$offset() {
        return share_mode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned char share_mode
     * }
     */
    public static byte share_mode(MemorySegment struct) {
        return struct.get(share_mode$LAYOUT, share_mode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned char share_mode
     * }
     */
    public static void share_mode(MemorySegment struct, byte fieldValue) {
        struct.set(share_mode$LAYOUT, share_mode$OFFSET, fieldValue);
    }

    private static final OfInt pages_reusable$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pages_reusable"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int pages_reusable
     * }
     */
    public static final OfInt pages_reusable$layout() {
        return pages_reusable$LAYOUT;
    }

    private static final long pages_reusable$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int pages_reusable
     * }
     */
    public static final long pages_reusable$offset() {
        return pages_reusable$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int pages_reusable
     * }
     */
    public static int pages_reusable(MemorySegment struct) {
        return struct.get(pages_reusable$LAYOUT, pages_reusable$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int pages_reusable
     * }
     */
    public static void pages_reusable(MemorySegment struct, int fieldValue) {
        struct.set(pages_reusable$LAYOUT, pages_reusable$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

