// Generated by jextract

package com.github.marschall.objectivej.header;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct vm_statistics {
 *     natural_t free_count;
 *     natural_t active_count;
 *     natural_t inactive_count;
 *     natural_t wire_count;
 *     natural_t zero_fill_count;
 *     natural_t reactivations;
 *     natural_t pageins;
 *     natural_t pageouts;
 *     natural_t faults;
 *     natural_t cow_faults;
 *     natural_t lookups;
 *     natural_t hits;
 *     natural_t purgeable_count;
 *     natural_t purges;
 *     natural_t speculative_count;
 * }
 * }
 */
public class vm_statistics {

    vm_statistics() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ObjCRuntime.C_INT.withName("free_count"),
        ObjCRuntime.C_INT.withName("active_count"),
        ObjCRuntime.C_INT.withName("inactive_count"),
        ObjCRuntime.C_INT.withName("wire_count"),
        ObjCRuntime.C_INT.withName("zero_fill_count"),
        ObjCRuntime.C_INT.withName("reactivations"),
        ObjCRuntime.C_INT.withName("pageins"),
        ObjCRuntime.C_INT.withName("pageouts"),
        ObjCRuntime.C_INT.withName("faults"),
        ObjCRuntime.C_INT.withName("cow_faults"),
        ObjCRuntime.C_INT.withName("lookups"),
        ObjCRuntime.C_INT.withName("hits"),
        ObjCRuntime.C_INT.withName("purgeable_count"),
        ObjCRuntime.C_INT.withName("purges"),
        ObjCRuntime.C_INT.withName("speculative_count")
    ).withName("vm_statistics");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt free_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("free_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t free_count
     * }
     */
    public static final OfInt free_count$layout() {
        return free_count$LAYOUT;
    }

    private static final long free_count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t free_count
     * }
     */
    public static final long free_count$offset() {
        return free_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t free_count
     * }
     */
    public static int free_count(MemorySegment struct) {
        return struct.get(free_count$LAYOUT, free_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t free_count
     * }
     */
    public static void free_count(MemorySegment struct, int fieldValue) {
        struct.set(free_count$LAYOUT, free_count$OFFSET, fieldValue);
    }

    private static final OfInt active_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("active_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t active_count
     * }
     */
    public static final OfInt active_count$layout() {
        return active_count$LAYOUT;
    }

    private static final long active_count$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t active_count
     * }
     */
    public static final long active_count$offset() {
        return active_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t active_count
     * }
     */
    public static int active_count(MemorySegment struct) {
        return struct.get(active_count$LAYOUT, active_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t active_count
     * }
     */
    public static void active_count(MemorySegment struct, int fieldValue) {
        struct.set(active_count$LAYOUT, active_count$OFFSET, fieldValue);
    }

    private static final OfInt inactive_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("inactive_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t inactive_count
     * }
     */
    public static final OfInt inactive_count$layout() {
        return inactive_count$LAYOUT;
    }

    private static final long inactive_count$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t inactive_count
     * }
     */
    public static final long inactive_count$offset() {
        return inactive_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t inactive_count
     * }
     */
    public static int inactive_count(MemorySegment struct) {
        return struct.get(inactive_count$LAYOUT, inactive_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t inactive_count
     * }
     */
    public static void inactive_count(MemorySegment struct, int fieldValue) {
        struct.set(inactive_count$LAYOUT, inactive_count$OFFSET, fieldValue);
    }

    private static final OfInt wire_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wire_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t wire_count
     * }
     */
    public static final OfInt wire_count$layout() {
        return wire_count$LAYOUT;
    }

    private static final long wire_count$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t wire_count
     * }
     */
    public static final long wire_count$offset() {
        return wire_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t wire_count
     * }
     */
    public static int wire_count(MemorySegment struct) {
        return struct.get(wire_count$LAYOUT, wire_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t wire_count
     * }
     */
    public static void wire_count(MemorySegment struct, int fieldValue) {
        struct.set(wire_count$LAYOUT, wire_count$OFFSET, fieldValue);
    }

    private static final OfInt zero_fill_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("zero_fill_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t zero_fill_count
     * }
     */
    public static final OfInt zero_fill_count$layout() {
        return zero_fill_count$LAYOUT;
    }

    private static final long zero_fill_count$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t zero_fill_count
     * }
     */
    public static final long zero_fill_count$offset() {
        return zero_fill_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t zero_fill_count
     * }
     */
    public static int zero_fill_count(MemorySegment struct) {
        return struct.get(zero_fill_count$LAYOUT, zero_fill_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t zero_fill_count
     * }
     */
    public static void zero_fill_count(MemorySegment struct, int fieldValue) {
        struct.set(zero_fill_count$LAYOUT, zero_fill_count$OFFSET, fieldValue);
    }

    private static final OfInt reactivations$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reactivations"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t reactivations
     * }
     */
    public static final OfInt reactivations$layout() {
        return reactivations$LAYOUT;
    }

    private static final long reactivations$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t reactivations
     * }
     */
    public static final long reactivations$offset() {
        return reactivations$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t reactivations
     * }
     */
    public static int reactivations(MemorySegment struct) {
        return struct.get(reactivations$LAYOUT, reactivations$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t reactivations
     * }
     */
    public static void reactivations(MemorySegment struct, int fieldValue) {
        struct.set(reactivations$LAYOUT, reactivations$OFFSET, fieldValue);
    }

    private static final OfInt pageins$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pageins"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t pageins
     * }
     */
    public static final OfInt pageins$layout() {
        return pageins$LAYOUT;
    }

    private static final long pageins$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t pageins
     * }
     */
    public static final long pageins$offset() {
        return pageins$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t pageins
     * }
     */
    public static int pageins(MemorySegment struct) {
        return struct.get(pageins$LAYOUT, pageins$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t pageins
     * }
     */
    public static void pageins(MemorySegment struct, int fieldValue) {
        struct.set(pageins$LAYOUT, pageins$OFFSET, fieldValue);
    }

    private static final OfInt pageouts$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pageouts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t pageouts
     * }
     */
    public static final OfInt pageouts$layout() {
        return pageouts$LAYOUT;
    }

    private static final long pageouts$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t pageouts
     * }
     */
    public static final long pageouts$offset() {
        return pageouts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t pageouts
     * }
     */
    public static int pageouts(MemorySegment struct) {
        return struct.get(pageouts$LAYOUT, pageouts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t pageouts
     * }
     */
    public static void pageouts(MemorySegment struct, int fieldValue) {
        struct.set(pageouts$LAYOUT, pageouts$OFFSET, fieldValue);
    }

    private static final OfInt faults$LAYOUT = (OfInt)$LAYOUT.select(groupElement("faults"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t faults
     * }
     */
    public static final OfInt faults$layout() {
        return faults$LAYOUT;
    }

    private static final long faults$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t faults
     * }
     */
    public static final long faults$offset() {
        return faults$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t faults
     * }
     */
    public static int faults(MemorySegment struct) {
        return struct.get(faults$LAYOUT, faults$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t faults
     * }
     */
    public static void faults(MemorySegment struct, int fieldValue) {
        struct.set(faults$LAYOUT, faults$OFFSET, fieldValue);
    }

    private static final OfInt cow_faults$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cow_faults"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t cow_faults
     * }
     */
    public static final OfInt cow_faults$layout() {
        return cow_faults$LAYOUT;
    }

    private static final long cow_faults$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t cow_faults
     * }
     */
    public static final long cow_faults$offset() {
        return cow_faults$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t cow_faults
     * }
     */
    public static int cow_faults(MemorySegment struct) {
        return struct.get(cow_faults$LAYOUT, cow_faults$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t cow_faults
     * }
     */
    public static void cow_faults(MemorySegment struct, int fieldValue) {
        struct.set(cow_faults$LAYOUT, cow_faults$OFFSET, fieldValue);
    }

    private static final OfInt lookups$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lookups"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t lookups
     * }
     */
    public static final OfInt lookups$layout() {
        return lookups$LAYOUT;
    }

    private static final long lookups$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t lookups
     * }
     */
    public static final long lookups$offset() {
        return lookups$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t lookups
     * }
     */
    public static int lookups(MemorySegment struct) {
        return struct.get(lookups$LAYOUT, lookups$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t lookups
     * }
     */
    public static void lookups(MemorySegment struct, int fieldValue) {
        struct.set(lookups$LAYOUT, lookups$OFFSET, fieldValue);
    }

    private static final OfInt hits$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t hits
     * }
     */
    public static final OfInt hits$layout() {
        return hits$LAYOUT;
    }

    private static final long hits$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t hits
     * }
     */
    public static final long hits$offset() {
        return hits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t hits
     * }
     */
    public static int hits(MemorySegment struct) {
        return struct.get(hits$LAYOUT, hits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t hits
     * }
     */
    public static void hits(MemorySegment struct, int fieldValue) {
        struct.set(hits$LAYOUT, hits$OFFSET, fieldValue);
    }

    private static final OfInt purgeable_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("purgeable_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t purgeable_count
     * }
     */
    public static final OfInt purgeable_count$layout() {
        return purgeable_count$LAYOUT;
    }

    private static final long purgeable_count$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t purgeable_count
     * }
     */
    public static final long purgeable_count$offset() {
        return purgeable_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t purgeable_count
     * }
     */
    public static int purgeable_count(MemorySegment struct) {
        return struct.get(purgeable_count$LAYOUT, purgeable_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t purgeable_count
     * }
     */
    public static void purgeable_count(MemorySegment struct, int fieldValue) {
        struct.set(purgeable_count$LAYOUT, purgeable_count$OFFSET, fieldValue);
    }

    private static final OfInt purges$LAYOUT = (OfInt)$LAYOUT.select(groupElement("purges"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t purges
     * }
     */
    public static final OfInt purges$layout() {
        return purges$LAYOUT;
    }

    private static final long purges$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t purges
     * }
     */
    public static final long purges$offset() {
        return purges$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t purges
     * }
     */
    public static int purges(MemorySegment struct) {
        return struct.get(purges$LAYOUT, purges$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t purges
     * }
     */
    public static void purges(MemorySegment struct, int fieldValue) {
        struct.set(purges$LAYOUT, purges$OFFSET, fieldValue);
    }

    private static final OfInt speculative_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("speculative_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * natural_t speculative_count
     * }
     */
    public static final OfInt speculative_count$layout() {
        return speculative_count$LAYOUT;
    }

    private static final long speculative_count$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * natural_t speculative_count
     * }
     */
    public static final long speculative_count$offset() {
        return speculative_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * natural_t speculative_count
     * }
     */
    public static int speculative_count(MemorySegment struct) {
        return struct.get(speculative_count$LAYOUT, speculative_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * natural_t speculative_count
     * }
     */
    public static void speculative_count(MemorySegment struct, int fieldValue) {
        struct.set(speculative_count$LAYOUT, speculative_count$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

